# Imports préalables pour visualisation pratique

In [223]:
import pandas as pd
pd.set_option("display.max_columns", None )
data = pd.read_csv("titanic.csv")

# Python

#### .append() apprentissage d'élément à une liste

In [224]:
liste_chiffre = [1, 2, 3, 4, 5]
a_ajouter = "Xavier"

liste_chiffre.append(a_ajouter)
liste_chiffre

[1, 2, 3, 4, 5, 'Xavier']

In [225]:
# une liste peut apprendre une autre liste comme élément
liste_chiffre_2 = [1, 2, 3, 4, 5]
a_ajouter_2 = ["Xavier, Gerald"]

liste_chiffre_2.append(a_ajouter_2)
liste_chiffre_2

[1, 2, 3, 4, 5, ['Xavier, Gerald']]

#### .extend() ajoute une 2ème liste à la suite de la première

In [226]:
liste_chiffre_3 = [1, 2, 3, 4, 5]
liste_chiffre_4 = [6,7,8,9,10]

liste_chiffre_3.extend(liste_chiffre_4)
liste_chiffre_3

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

#### .remove() supprime l'élement de la liste sélectionné

In [227]:
liste_chiffre = [1, 2, 3, 4, 5]

liste_chiffre.remove(1)
liste_chiffre

[2, 3, 4, 5]

#### .pop() supprime l'élément par rapport à son index en partant de 0
mais il permet également de stocker la valeur supprimée dans une variable

In [228]:
list_chiffre = [1, 2, 3, 4, 5]

list_chiffre.pop(3)
list_chiffre

[1, 2, 3, 5]

In [229]:
# stockage du pop dans une variable
list_chiffre = [1, 2, 3, 4, 5]

a_stocker = list_chiffre.pop(3)

print(a_stocker)
print(list_chiffre)

4
[1, 2, 3, 5]

# Pandas

In [230]:
data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### .rename permet de renommer les index, colonne et lignes
ci-dessous cas d'usage modifiant le header de la colonne "Name"

In [231]:
data.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [232]:
data = data.rename(columns = {"Name" : "Nom"})

In [233]:
data.head(1)

,PassengerId,Survived,Pclass,Nom,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [234]:
data = data.rename(columns = {"Nom" : "Name"})

#### .astype() permet de modifier la nature du Dtype "string", "int64", "float", Dtype, etc...
ci-dessous cas d'usage de passage d'un id détecté "int64" pour un passage en "string"

In [235]:
data["PassengerId"].dtypes

dtype('int64')

In [236]:
data["PassengerId"] = data["PassengerId"].astype("string")

In [237]:
data["PassengerId"].dtypes

string[python]

#### .drop() permet de supprimer des colonnes ou lignes
ci-dessous un cas d'usage pour une colonne déterminé comme inutile

In [238]:
data.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [239]:
data = data.drop(columns= ["Ticket"])

In [240]:
data.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.25,NaN,S

#### .dropna() permet de supprimer des lignes contenant des valeurs null
ci-dessous un cas d'usage pour des lignes déterminées comme inutiles en fonction de leurs valeurs null dans la colonne "Cabin" !!! supprime toutes les lignes !!! cf "Age" ci-dessous

In [241]:
data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [242]:
data = data.dropna(subset= "Cabin")

In [243]:
data.isna().sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex             0
Age            19
SibSp           0
Parch           0
Fare            0
Cabin           0
Embarked        2
dtype: int64

#### .replace() remplace la valeur spécifiée par celle choisie

In [244]:
data.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C

In [245]:
data["Cabin"] = data["Cabin"].replace("C85",  "C88")

In [246]:
data.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C88,C

#### .str.split() sépare les chaînes de caractères en fonction du spérateur spécifié

In [247]:
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C88,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,51.8625,E46,S

In [248]:
# nécessite le passage en Dtype str si pas le cas
data["Name"]= data["Name"].astype("string")

data["Name_test"] = data["Name"].str.split(",") # renvoi une liste en fonction du séparateur ici espace " "

print(type(data["Name_test"][1]))
print(data["Name_test"][1]) # a la ligne 1 de la colonne la valeur est donc remplacée par une liste

<class 'list'>
['Cumings', ' Mrs. John Bradley (Florence Briggs Thayer)']

In [249]:
# pour créer ou ne garder que la première valeur on expand avec sélection dans la liste séparer ici 0 pour le 1er élément
data["Name"] = data["Name"].str.split(",", n = 1, expand= True)[0]

In [250]:
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Name_test
1,2,1,1,Cumings,female,38.0,1,0,71.2833,C88,C,"[Cumings, Mrs. John Bradley (Florence Briggs ..."
3,4,1,1,Futrelle,female,35.0,1,0,53.1000,C123,S,"[Futrelle, Mrs. Jacques Heath (Lily May Peel)]"
6,7,0,1,McCarthy,male,54.0,0,0,51.8625,E46,S,"[McCarthy, Mr. Timothy J]"

In [251]:
data = pd.read_csv("titanic.csv")

#### pd.DataFrame() transforme une variable en dataframe

In [252]:
variable_valeurs_nulles = data.isna().sum()
variable_valeurs_nulles

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [253]:
df_valeurs_nulles = pd.DataFrame(variable_valeurs_nulles)
df_valeurs_nulles

               0
PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age          177
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin        687
Embarked       2

#### .T et .transpose() transpose lignes et colonnes du df
reprise du df_valeurs_nulles pour illustrer

In [254]:
df_valeurs_nulles.T

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,0,0,0,0,177,0,0,0,0,687,2

In [255]:
df_valeurs_nulles.transpose()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,0,0,0,0,177,0,0,0,0,687,2

# Numpy

In [256]:
import numpy as np

In [257]:
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

#### np.where filtre en fonction des conditions demandées

In [258]:
mask_hommes_mineurs = np.where((data["Sex"] == "male") & (data["Age"] < 18))
df_hommes_mineurs = data.loc[mask_hommes_mineurs]

In [259]:
df_hommes_mineurs.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
50,51,0,3,"Panula, Master. Juha Niilo",male,7.0,4,1,3101295,39.6875,NaN,S